## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       RESOURCE                        |
|--------|-------------------------------------------------------|
| add    | `aws_iam_policy.superset_athena_read`                 |
|        | `aws_iam_role.superset_athena_read`                   |
|        | `aws_iam_role_policy_attachment.superset_athena_read` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.superset_athena_read will be created
  + resource "aws_iam_policy" "superset_athena_read" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SupersetAthenaRead"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "athena:StopQueryExecution",
                          + "athena:StartQueryExecution",
                          + "athena:ListWorkGroups",
                          + "athena:ListTagsForResource",
                          + "athena:ListTableMetadata",
                          + "athena:ListQueryExecutions",
                          + "athena:ListNamedQueries",
                          + "athena:ListDatabases",
                          + "athena:ListDataCatalogs",
                          + "athena:GetWorkGroup",
                          + "athena:GetQueryResultsStream",
                          + "athena:GetQueryResults",
                          + "athena:GetQueryExecution",
                          + "athena:GetPreparedStatement",
                          + "athena:GetNamedQuery",
                          + "athena:DeletePreparedStatement",
                          + "athena:CreatePreparedStatement",
                          + "athena:BatchGetQueryExecution",
                          + "athena:BatchGetNamedQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AthenaRead"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/*",
                          + "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a",
                        ]
                      + Sid      = "S3AthenaSourceBucketRead"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::calvinrodotestbucket/*",
                          + "arn:aws:s3:::calvinrodotestbucket",
                        ]
                      + Sid      = "S3AthenaResultBucketWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Terraform" = "true"
        }
      + tags_all    = {
          + "Terraform" = "true"
        }
    }

  # aws_iam_role.superset_athena_read will be created
  + resource "aws_iam_role" "superset_athena_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:role/superset_ecs_task_role"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "This role allows the Superset ECS task to read from Athena as a datasource"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SupersetAthenaRead"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Terraform" = "true"
        }
      + tags_all              = {
          + "Terraform" = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.superset_athena_read will be created
  + resource "aws_iam_role_policy_attachment" "superset_athena_read" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SupersetAthenaRead"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
